/*（2） 有 102 个整数，其中有 50 个数出现了两次，2 个数出现了一次
找出出现了一 次的那 2 个数。*/

# include <stdio.h>
# include <stdlib.h>

int main(void) {

	int i, t = 1, k = 0, j = 0;
	int a[102], b[2][101];
	for (i = 0; i < 100; i++) {				//将50对数放入数组
		if (i < 50) { a[i] = i + 1;
		} 
		else {
			a[i] = i - 49;
		} 
	} 
	a[100] = 200;						//放入两个仅出现一次的数
	a[101] = 203; 
	for (i = 0; i < 102; i++) {			//遍历数组得到k=202^200
		k = k ^ a[i]; 
	} 
	while (!(k & t)) {					/*让“1”与k循环按位与，目的是得到k二进制中的第一个1
										因为根据按位异或原理，唯1的一位即为两数不同的一位，
										根据这一位不同把两个数分为两堆*/
		t = t << 1;
	} 
	for (k = 0, i = 0; i < 102; i++) {
		if (t & a[i]) {					//分堆，得到两堆，两个只出现一次的数分别在两堆
			b[0][k++] = a[i];
		}
		else {
			b[1][j++] = a[i];
		}
	} 
	for (j = 0; j < 2; j++) {
		for (t = 0, i = 0; i < k; i++) {
			t = t ^ b[j][i];				//按位异或找出只出现一次的数
		} 
		printf("%d\n", t);
	}
	system("pause");
	return 0;
}